namespace _30.Algorithm
{
    internal class Program
    {
        /*
            알고리즘 (Algorithm)
            문제를 해결하기 위해 정해진 진행절차나 방법
            컴퓨터에서 알고리즘은 어떠한 행동을 하기 위해서 만들어진 프로그램 명령어의 집합
         */

        // <알고리즘 조건>
        // 1. 입력 : 알고리즘은 0개 이상의 입력을 가져야 함
        // 2. 출력 : 알고리즘은 최소 1개 이상의 결과를 가져야 함
        // 3. 명확성 : 수행 과정은 모호하지 않고 정확한 수단을 제공해야 함
        // 4. 유한성 : 수행 과정은 무한하지 않고 유한한 작업 이후에 정지해야 함
        // 5. 효과성 : 모든 과정은 명백하게 실행 가능해야 함





        static void Main(string[] args)
        {   
            // <의사코드> -> 인간의 언어로 흐름도를 먼저 그려보는것
            // 가장 큰 수를 찾기
            int[] array = { 1, 2, 3, 4, 5 };
            // 1. 가장 큰 수를 저장할 변수 만들기
            int max;
            // 2. 맨 처음부터 시작
            int index = 0;
            // 3. 맨 처음부터 시작한 수가 다음 수보다 작으면 큰 수를 다음수로 변경
            // 4. 다음 수를 또 다시 반복
        }
    }
}
